In [16]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/my_db.db/")
print(my_conn.name)

sqlite

In [17]:
r_set=my_conn.execute('''select name from sqlite_master where type = 'table' ''')
for row in r_set:
  print(row)

('category',)
('subcategory',)
('student',)

In [18]:
from sqlalchemy.exc import SQLAlchemyError
try:
  my_conn.execute('''DROP table student;''')
  print("student table deleted")
except SQLAlchemyError as e:
  error = str(e._dict_['orig'])
  print(error)

student table deleted

In [19]:
from sqlalchemy.exc import SQLAlchemyError
try:
  my_conn.execute('''DROP table subcategory;''')
  print(" table deleted")
except SQLAlchemyError as e:
  error = str(e._dict_['orig'])
  print(error)

 table deleted

In [20]:
from sqlalchemy.exc import SQLAlchemyError
try:
  my_conn.execute('''DROP table category;''')
  print(" table deleted")
except SQLAlchemyError as e:
  error = str(e._dict_['orig'])
  print(error)

 table deleted

In [21]:
from sqlalchemy.exc import SQLAlchemyError
try:
  my_conn.execute('''
    CREATE TABLE IF NOT EXISTS student(id integer primary key,
                                       name text,
                                       course text,
                                       grade integer
                                       );''')
  
  print("Student Table created successfully")
except SQLAlchemyError as e:
  error = str(e._dict_['orig'])
  print(error)

Student Table created successfully

In [22]:
r_set=my_conn.execute('''INSERT INTO `student`
(`id`,`name`,`course`,`grade`) VALUES
(1, 'John Deo', 'AI', 4.0),
(2, 'Max Ruin', 'Business', 1.0),
(3, 'Arnold', 'Business', 4.5),
(4, 'Krish Star', 'AI', 3.75),
(5, 'John Mike', 'AI', 3.0),
(6, 'Alex John', 'AI', 4.5),
(7, 'My John Rob', 'IT', 3.0),
(8, 'Asruid', 'IT', 4.5),
(9, 'Tes Qry', 'Retail Management', 3.0),
(10, 'Big John', 'AI', 4.5),
(11, 'Ronald', 'Retail Management', 3.5),
(27, 'Big Nose', 'Business', 3.0),
(28, 'Rojj Base', 'Supply Chain', 4.0),
(29, 'Tess Played', 'Supply Chain', 4.5),
(30, 'Reppy Red', 'Retail Management', 3.5),
(31, 'Marry Toeey', 'AI', 4.5),
(32, 'Binn Rott', 'Supply Chain', 4.5);''')

In [24]:
r_set=my_conn.execute('''INSERT INTO `student`
(`id`,`name`,`course`,`grade`) VALUES
(33, 'Kenn Rein', 'Database Management', 1.5),
(34, 'Gain Toe', 'Business', 1.75),
(35, 'Rows Noump', 'Database Management', 2.5);''')